app/views/customers/orders.html.haml

SELECT `orders`.* FROM `orders` WHERE `orders`.`customer_id` = 1
---
%h3= "Order History for #{@customer.last_name+', '+@customer.first_name}"

SELECT `order_items`.* FROM `order_items` WHERE `order_items`.`order_id` = 1
---
				%th Price
		-order.order_items.each do |order_item|