app/views/orders/index.html.haml

				= link_to("Order "+order.id.to_s, order_path(order))
				= " made on #{order.created_at}, by #{order.customer.last_name}, #{order.customer.first_name}"
---
SELECT `customers`.* FROM `customers` WHERE `customers`.`id` = 1 LIMIT 1

			%th Price
		-order.order_items.each do |order_item|
---
SELECT `order_items`.* FROM `order_items` WHERE `order_items`.`order_id` = 1
SELECT `orders`.* FROM `orders` ORDER BY created_at