app/views/orders/show.html.haml

%h3= "View the Details of order ##{@order.id}"
%div= "Order made by: #{@order.customer.last_name}, #{@order.customer.first_name}"
---
SELECT `customers`.* FROM `customers` WHERE `customers`.`id` = 1 LIMIT 1

		%th Retail Price
	-@order.order_items.each do |order_item|
---
SELECT `order_items`.* FROM `order_items` WHERE `order_items`.`order_id` = 1