app/controllers/customers_controller.rb

  def create
    @customer = Customer.new(params[:customer])
    customer_token = SecureRandom.uuid
    @customer.customer_token = customer_token

    if @customer.filled_in? && @customer.save
      @shopping_cart.customer = @customer
      @shopping_cart.save
---
INSERT INTO `customers` (`address`, `created_at`, `customer_token`, `first_name`, `last_name`, `updated_at`) VALUES ('85 Barley Street Cohoes, NY 33345', '2013-12-24 15:41:29', 'aa4a4877-54b4-464a-bc46-bce454baa11c', 'John', 'O\'Malley', '2013-12-24 15:41:29')
UPDATE `shopping_carts` SET `customer_id` = 1, `updated_at` = '2013-12-24 15:41:29' WHERE `shopping_carts`.`id` = 1