app/controllers/orders_controller.rb

SELECT `orders`.* FROM `orders` ORDER BY created_at
---
	def index
		@orders = Order.order("created_at").all