app/controllers/products_controller.rb

SELECT `products`.* FROM `products` WHERE (name like '%b%' or description like '%b%') ORDER BY name
---
  def index
  	# if @q = params[:txt_search]
  	# 	where_clause = "name like '%#{@q}%' or description like '%#{@q}%'"
  	# else
  	# 	where_clause = "1=1"
  	# end
  	@products = Product.where(where_clause).order(:name).all

SELECT `products`.* FROM `products` WHERE (1=1) ORDER BY name
---
  def admin
    #All Admins must first go through this action
    @admin = true
    session[:admin] = "true" #once this is set the application_contoller handles setting the variable
    @products = Product.where(where_clause).order(:name).all

SELECT `product_categories`.* FROM `product_categories` WHERE `product_categories`.`id` = 1 LIMIT 1
---
  def list_by_category
  	if cat_id = params[:id]
  		@cat = ProductCategory.find(cat_id)

SELECT `products`.* FROM `products` WHERE `products`.`id` = 2 LIMIT 1
---
  def add_to_cart
  	#binding.pry
  	#get cart for current user or create a new one
  	shopping_cart = get_or_create_cart
  	shopping_cart.add_product(Product.find(params[:product_id]))

INSERT INTO `products` (`created_at`, `description`, `name`, `product_category_id`, `retail_price`, `updated_at`, `wholesale_cost`) VALUES ('2013-12-24 16:04:57', 'Sweet Deal', 'Product #3', NULL, 50, '2013-12-24 16:04:57', 55)
---
  def create
    @product = Product.new(params[:product])
    if @product.save

SELECT `products`.* FROM `products` WHERE `products`.`id` = 1 LIMIT 1
UPDATE `products` SET `description` = 'Adding a Description', `retail_price` = 550, `wholesale_cost` = 489, `updated_at` = '2013-12-24 12:49:34' WHERE `products`.`id` = 1
---
  def update
    @product = Product.find(params[:id])

    if @product.update_attributes(params[:product])