app/controllers/product_categories_controller.rb

  def index
    @product_categories = ProductCategory.all
---
SELECT `product_categories`.* FROM `product_categories`

  def edit
    @product_category = ProductCategory.find(params[:id])
---
SELECT `product_categories`.* FROM `product_categories` WHERE `product_categories`.`id` = 1 LIMIT 1