app/controllers/shopping_carts_controller.rb

  def show
  	@shopping_cart = get_or_create_cart
  	@cart_items = @shopping_cart.cart_items
    @can_place_order = true if @cart_items.length > 0
---
SELECT `cart_items`.* FROM `cart_items` WHERE `cart_items`.`shopping_cart_id` = 1

  def place_order
  	@shopping_cart = ShoppingCart.find_by_cart_token(session[:cart_token])
---
SELECT `shopping_carts`.* FROM `shopping_carts` WHERE `shopping_carts`.`cart_token` = '8cc31b7d-be74-48f6-9c27-f11810fd4359' LIMIT 1

  def clear_cart
  	@shopping_cart = ShoppingCart.find_by_cart_token(session[:cart_token])
---
SELECT `shopping_carts`.* FROM `shopping_carts` WHERE `shopping_carts`.`cart_token` = '4a493675-2763-4063-a0a0-6e3a82944331' LIMIT 1