app/views/products/_form.html.haml

SELECT `product_categories`.* FROM `product_categories` ORDER BY name
---
-@cats = ProductCategory.order(:name).all.map { |cat| [cat.name, cat.id]}